Revit 2027 API
MEPSpaceConstruction.NewConstruction Method
Create a new construction for Space constructions.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPBuildingConstruction NewConstruction(
	string pName
)
Public Function NewConstruction (
	pName As String
) As MEPBuildingConstruction
public:
MEPBuildingConstruction^ NewConstruction(
	String^ pName
)
member NewConstruction :
        pName : string -> MEPBuildingConstruction
Parameters
pName String
The name of the new Construction.
Return Value
MEPBuildingConstruction
Remarks
If the name is same as an existing one, an exception will be thrown.
See Also
Reference
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace